import { Box, Container, Grid, Group, List, Text, Title } from '@mantine/core'

import { MetaTags } from '@redwoodjs/web'

import Sidebar from 'src/components/Sidebar/Sidebar'

const HomePage = () => {
  return (
    <>
      <MetaTags title="Home" description="Home page" />
      <Container size={'lg'}>
        <Grid>
          <Grid.Col span={9}>
            <Group position={'center'} direction={'column'}>
              <Title order={2}>О нас</Title>
              <img src="img/lookup.png" alt="" width={'800px'} />
            </Group>
            <Box>
              <Text sx={{ textIndent: '2rem' }} align={'justify'}>
                Владимирский областной институт усовершенствования учителей
                (ВОИУУ) открыт решением исполкома областного Совета депутатов
                трудящихся № 1066 29 августа 1946 года. Первым директором его
                назначен Петухов Иван Михайлович. Первоначальный штат
                сотрудников состоял из 5 человек. В 1949 г. его увеличили до 14
                единиц.
              </Text>
              <Text sx={{ textIndent: '2rem' }} align={'justify'}>
                В связи с реализацией «Закона о всеобщем семилетнем обязательном
                обучении» работа института тех лет строилась по трем основным
                направлениям:
              </Text>
              <List withPadding>
                <List.Item>
                  организация курсов повышения квалификации учителей,
                  руководителей школ и отделов образования;
                </List.Item>
                <List.Item>
                  оказание методической помощи педагогическим кабинетам и
                  методическим объединениям в территориях;
                </List.Item>
                <List.Item>
                  изучение, обобщение и распространение передового
                  педагогического опыта; подготовка воспитателей детских садов и
                  учителей на краткосрочных 10-месячных курсах.
                </List.Item>
              </List>
              <Text sx={{ textIndent: '2rem' }} align={'justify'}>
                В 50-е годы при активной роли методистов ИУУ школы области
                приступили к внедрению политехнического обучения, проводятся
                первые выставки передового педагогического опыта, педагогические
                чтения. По заданию АПН институт занимается экспериментом по
                проблемам преемственности в образовании. Появляются первые
                печатные издания ИУУ.
              </Text>
              <Text sx={{ textIndent: '2rem' }} align={'justify'}>
                60-е годы коллектив ИУУ совместно с МП и АПН сосредоточен на
                работе по апробации новых программ и учебников, переподготовке
                учителей по их освоению.
              </Text>
            </Box>
            <Group direction={'column'} position={'center'}>
              <br />
              <img src="img/1963.png" alt="" width={'530px'} />
              <Text weight={700}>
                Коллектив ИУУ во главе с Маровым. 1963 г.
              </Text>
              <br />
            </Group>
            <Box>
              <Text sx={{ textIndent: '2rem' }} align={'justify'}>
                В 70-80-е годы политика ОблОНО направлена на укрепление
                авторитета ИУУ и превращение его в научно-методический центр
                работы с педагогическими кадрами. В 1986 г. в ИУУ работают уже
                23 кабинета, штат увеличен до 39 методистов. В 1987 г. в
                структуре института создаются первые научные подразделения –
                кафедры, появляются собственные научные кадры. Деятельность ИУУ
                направлена на повышение эффективности педагогической
                деятельности учителя, развитие в ней творческих начал. Институт
                активно включается в опытно-экспериментальную работу.
              </Text>
            </Box>
            {/* END OF 70 IMG */}
            <Group position={'center'} direction={'column'}>
              <br />
              <img src="img/endof70.png" alt="" width={'530px'} />
              <Text weight={700}>
                Коллектив ИУУ с И.П.Петросяном. (конец 70-х годов.)
              </Text>
              <br />
            </Group>
            <Box>
              <Text sx={{ textIndent: '2rem' }} align={'justify'}>
                90-е годы – годы осмысления роли института в новой
                социально-политической и экономической ситуации, разработка
                стратегии и тактики управления, которые бы позволили не потерять
                ни крупицы ценнейшего опыта и соответствовать духу времени.
                Создание научных лабораторий, открытие новых кафедр, внедрение
                новых педагогических технологий, разработка новых учебных планов
                и регионального образовательного стандарта, начало конкурса
                «Учитель года», практика организации всероссийских и
                международных конференций – этот опыт поднял ВОИУУ на новый
                уровень, позволив ему в 2004 г. поменять свой статус на ВИПКРО.
              </Text>
              <Text sx={{ textIndent: '2rem' }} align={'justify'}>
                Постановлением губернатора Владимирской области за № 780 от 22
                сентября 2009 года Владимирскому институту повышения
                квалификации работников образования присвоено имя выдающегося
                отечественного педагога и исследователя, доктора педагогических
                наук, профессора, академика, действительного члена Российской
                академии образования Людмилы Ивановны Новиковой.
              </Text>
            </Box>
          </Grid.Col>
          <Grid.Col span={3}>
            <Sidebar />
          </Grid.Col>
        </Grid>
      </Container>
    </>
  )
}

export default HomePage
